---
title: SlabShapeVertex
classe: Autodesk.Revit.DB.SlabShapeVertex
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# SlabShapeVertex

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `slabShapeVertex.IsValidObject` | Boolean |
| `XYZ Position { get; }` | `slabShapeVertex.Position` | XYZ |
| `SlabShapeVertexType VertexType { get; }` | `slabShapeVertex.VertexType` | SlabShapeVertexType |
| `Void Dispose()` | `slabShapeVertex.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```